{
  "lang": {
    "en": "En",
    "fr": "Fr",
    "jp": "日本語"
  },
  "nav": {
    "projects": "Projects",
    "contact": "Contact",
    "about": "About",
    "resume": "Resume"
  },
  "title": "Hi! Welcome to my portfolio",
  "slideTitle": {
    "title": "Hi! Welcome",
    "firstName": "Miguel",
    "name": "Molano",
    "type": "Web developer",
    "scroll": "Scroll to reveal"
  },
  "projectSection": {
    "title": "Projects",
    "filter": "Filter by",
    "front": "Front-end",
    "back": "Back-end",
    "working": "In progress",
    "all": "All",
    "show": "Show project"
  },
  "contactSection": {
    "title": "Contact",
    "links": "Links",
    "mailMe": "Contact me!",
    "inputName": "Name",
    "inputMail": "Email",
    "inputSubject": "Subject",
    "inputTextArea": "My awesome message about ...",
    "button": "Send Message!",
    "submit": "Sending...",
    "callText": "Need a website redesign, new functionality, or technical assistance in web development? Contact me now! I'll get back to you as soon as possible. Looking forward to work with you!"
  },
  "aboutSection": {
    "title": "About",
    "content": "Hey, my name is Miguel Molano, i'm a French web developer with an interest in UX & UI, as well as front-end and back-end development. I obtained my Master's degree in web development at IIM Paris in France, where i developed an expertise in designing and developing web applications with a strong focus on users experience. My passion for technology and languages led me to Japan where i had the opportunity to explore the local culture and language while keeping-up-to-date with the latest technological advancements in web development. This experience allowed me to acquire new skills and broaden my knowledge.",
    "resume": "Resume"
  },
  "projectPage": {
    "start": "Starting date",
    "end": "Ending date",
    "previous": "Previous project",
    "next": "Next project"
  },
  "errors": {
    "emailValidation": "An error occurred while validating the email address",
    "nameRequired": "Name is required",
    "nameLength": "Name must be at least 2 characters long",
    "subjectRequired": "Subject is required",
    "subjectLengthShort": "Subject is too short",
    "subjectLengthLong": "Subject is too long",
    "messageRequired": "Message is required",
    "messageLength": "Your message is too short, message must be at least 10 characters",
    "mailRequired": "Email is required",
    "promiseToast": {
      "pending": "Sending email ...",
      "success": "Your message has been sent ✅",
      "error": "An error has occurred, please send an email manually!"
    },
    "wrongUrl": "You seem lost, are you looking at the correct url?"
  },
  "projects": [
    {
      "id": 1,
      "title": "E-Commerce | React.js",
      "slug": "e-commerce-react",
      "type": "Front | WIP",
      "description": "This e-commerce web application is a personal project aimed at providing a good shopping experience. It allows users to easily add, view, and remove products from their carts. The payment process is handled by Stripe, and the login system is provided by Auth0.",
      "tools": [
        "github",
        "react.js",
        "next.js",
        "stripe",
        "auth0",
        "strapi",
        "typescript"
      ],
      "date": {
        "start": "2023-01-09",
        "end": "Pending | Will add more data"
      },
      "link": "https://github.com/mmolano/next-react-shop"
    },
    {
      "id": 2,
      "title": "Recipe API | Laravel",
      "slug": "recipe-api-laravel",
      "type": "Back | WIP",
      "description": "This project is a Laravel 9 REST API application that allows to: create, read, modify and delete recipes. The application is designed to be used by other applications to display recipes and his development is ongoing. The application utilizes PHPUnit tests and logs to record activites and manage errors to facilitate the resolution of any potential issues.",
      "tools": [
        "github",
        "laravel 9",
        "php",
        "phpunit",
        "swagger",
        "mysql",
        "rest api"
      ],
      "date": {
        "start": "2023-01-20",
        "end": "WIP"
      },
      "link": "https://github.com/mmolano/Laravel-Recipe-small-api"
    },
    {
      "id": 3,
      "type": "Front | Back",
      "title": "Fidensio | for partners",
      "slug": "fidensio-partners",
      "description": "This project is an application that i developed as a member of the Fidensio team. It utilizes serveral technologies, including Laravel 8, Vue.js and Stripe for payment processing. The aim of this project was to allow one of the company's partners to manage orders from a dashboard while providing a simple and effective desktop and mobile experience.",
      "tools": [
        "gitlab",
        "laravel 8",
        "php",
        "fidensio's API",
        "stripe",
        "mysql",
        "vue.js"
      ],
      "date": {
        "start": "2021-04-13",
        "end": "2021-08"
      }
    },
    {
      "id": 4,
      "title": "Fidensio | DB migration",
      "slug": "fidensio-migration",
      "type": "Back",
      "description": "The following project aimed at utilizing the company's brand new API and structure. The objective of this project was to migrate an old database to a new infrastructure while minimizing the risk of disruptigng the company's activities. To ensure a smooth and incident-free transition, a queue system was implemented to handle any potential issues that may occure during the migration. This project was entirely done by myself.",
      "tools": [
        "gitlab",
        "laravel 8",
        "php",
        "queues",
        "mysql"
      ],
      "date": {
        "start": "2021-07",
        "end": "2021-08"
      }
    },
    {
      "id": 5,
      "title": "Fidensio | API",
      "slug": "fidensio-api",
      "type": "Back",
      "description": "This application was carried out in close collaboration with the CTO of Fidensio, who brought his expertise to ensure the success of the project. It is one of the biggest technical projects of the company at that time, which aimed to migrate an existing application from Laravel 5 and PHP 7.4 to a REST API in Laravel 8 and PHP 8. This migration to a more recent and more performant infrastructure allows Fidensio to have a solution that is more suited and scalable to its needs. For this project i was in charge to refactor some services and make the PHPUnit tests for them using the TDD method.",
      "tools": [
        "gitlab",
        "laravel 8",
        "php",
        "laravel queues",
        "mysql",
        "phpunit",
        "tdd"
      ],
      "date": {
        "start": "2020-09",
        "end": "2021-08 | WIP (not finished when i left)"
      }
    },
    {
      "id": 6,
      "title": "Fidensio | Front-end",
      "slug": "fidensio-nuxt",
      "type": "Front",
      "description": "This brand new front-end application was built in collaboration with freelancers. In order to obtain all the necessary information, i had to connect this application, which was only provided with static informations (initial work made by the freelancer team) to the data available through Fidensio's API.",
      "tools": [
        "gitlab",
        "vue.js",
        "nuxt.js",
        "axios"
      ],
      "date": {
        "start": "2021-07",
        "end": "2021-08 | WIP (not finished when i left)"
      }
    }
  ]
}