{
  "lang": {
    "en": "En",
    "fr": "Fr",
    "jp": "日本語"
  },
  "nav": {
    "projects": "Projets",
    "contact": "Contact",
    "about": "À propos",
    "resume": "Curriculum"
  },
  "title": "Hey! Bienvenue",
  "slideTitle": {
    "title": "Hey! Bienvenue",
    "firstName": "Miguel",
    "name": "Molano",
    "type": "Développeur web",
    "scroll": "Scroller pour afficher"
  },
  "projectSection": {
    "title": "Projets",
    "filter": "Filtrer par",
    "front": "Front-end",
    "back": "Back-end",
    "working": "En cours",
    "all": "Tout",
    "show": "Voir projet"
  },
  "contactSection": {
    "title": "Contact",
    "links": "Liens",
    "mailMe": "Contactez-moi !",
    "inputName": "Nom",
    "inputMail": "Email",
    "inputSubject": "Sujet",
    "inputTextArea": "Mon message à propos de ...",
    "button": "Envoyer un message !",
    "submit": "En cours...",
    "callText": "Besoin d'une refonte de site, d'une nouvelle fonctionnalité ou d'assistance technique en développement web ? Contactez-moi dès maintenant ! Je répondrai aussi vite que possible à votre message. Je suis impatient de travailler avec vous !"
  },
  "aboutSection": {
    "title": "À propos",
    "content": "Hey, je m'appelle Miguel Molano, je suis un développeur web français avec un intérêt pour l'UX & l'UI ainsi que le développement front-end et back-end. J'ai obtenu mon Master en développement web à l'IIM Paris en France, où j'ai développé une expertise en conception d'applications web et avec une forte orientation utilisateur. Mon intérêt pour la technologie et les langues m'a conduit au Japon où j'ai eu l'opportunité d'explorer la culture et la langue locale tout en poursuivant mes veilles technologiques afin d'être à jour sur les avancés technologiques. Cette experience m'a permis d'acquérir de nouvelles compétences et d'élargir mes connaissances.",
    "resume": "Curriculum"
  },
  "projectPage": {
    "start": "Date de début",
    "end": "Date de fin",
    "previous": "Projet précédent",
    "next": "Projet suivant"
  },
  "errors": {
    "emailValidation": "Une erreur est survenue lors de la validation de l'adresse mail",
    "nameRequired": "Nom requis",
    "nameLength": "Le nom doit faire au moins 2 caractères",
    "subjectRequired": "Sujet requis",
    "subjectLengthShort": "Le sujet est trop court",
    "subjectLengthLong": "Le sujet est trop long",
    "messageRequired": "Message requis",
    "messageLength": "Le message est trop court, le message doit faire au moins 10 caractères",
    "mailRequired": "Email requis",
    "promiseToast": {
      "pending": "Envoie du mail ...",
      "success": "Le message a été envoyé ✅",
      "error": "Une erreur est survenue, veuillez envoyer un mail manuellement!"
    },
    "wrongUrl": "Il semblerait que l'url n'existe pas, l'url est-il correct?"
  },
  "projects": [
    {
      "id": 1,
      "title": "Application E-commerce | React.js",
      "slug": "e-commerce-react",
      "type": "Front | WIP",
      "description": "Cette application web e-commerce est un projet personnel conçue pour offrir un parcours d'achat simple pour un site de vente en ligne. Elle permet aux utilisateurs d'ajouter, de voir et de retirer des produits à leurs paniers en toute simplicité. Le processus de paiement est assuré par Stripe et le système de connexion est quant à lui assuré par Auth0.",
      "tools": [
        "github",
        "react.js",
        "next.js",
        "stripe",
        "auth0",
        "strapi",
        "typescript"
      ],
      "date": {
        "start": "2023-01-09",
        "end": "En cours | Ajout de données"
      },
      "link": "https://github.com/mmolano/next-react-shop"
    },
    {
      "id": 2,
      "title": "API de recettes | Laravel",
      "slug": "recipe-api-laravel",
      "type": "Back | WIP",
      "description": "Ce projet est une application API REST en Laravel 9 permettant la création, la lecture, la modification et la suppression de recettes de cuisine. Cette application est conçue pour être exploités par d'autres applications pour afficher les recettes. Le développement de ce projet est toujours en cours. L'application utilise des tests PHPUnit et des Logs afin d'enregistrer des activités et gérer les erreurs pour faciliter la résolution des problèmes éventuels.",
      "tools": [
        "github",
        "laravel 9",
        "php",
        "phpunit",
        "swagger",
        "mysql",
        "api rest"
      ],
      "date": {
        "start": "2023-01-20",
        "end": "En cours"
      },
      "link": "https://github.com/mmolano/Laravel-Recipe-small-api"
    },
    {
      "id": 3,
      "title": "Fidensio | App partenaires",
      "slug": "fidensio-partners",
      "type": "Front | Back",
      "description": "Ce projet est une application que j'ai développés seul en tant que membre de l'équipe de Fidensio. Elle utilise plusieurs technologies, notamment Laravel 8, Vue.js et Stripe pour le traitement des paiements. Le but de ce projet était de permettre à l'un des partenaires de l'entreprise de gérer les commandes depuis un dashboard, tout en offrant une expérience desktop et mobile simple et efficace.",
      "tools": [
        "gitlab",
        "laravel 8",
        "php",
        "api Fidensio",
        "stripe",
        "mysql",
        "vue.js"
      ],
      "date": {
        "start": "2021-04-13",
        "end": "2021-08"
      }
    },
    {
      "id": 4,
      "title": "Fidensio | API",
      "slug": "fidensio-api",
      "type": "Back",
      "description": "Ce projet a été réalisé en étroite collaboration avec le CTO de Fidensio, qui a apporté son expertise afin de garantir le succès du projet. Il s'agit d'un des plus gros projets technique de l'entreprise à ce moment et qui visait à migrer une application existante de Laravel 5 et PHP 7.4 vers une API REST en Laravel 8 et PHP 8. Cette migration d'infrastructure plus récente et plus performante permet à Fidensio d'avoir une solution plus adaptée et modulable en fonction de ses besoins. Pour ce projet, je me suis occupé de refactor certains service et de créer les tests PHPUnit en utilisant la méthode TDD",
      "tools": [
        "gitlab",
        "laravel 8",
        "php",
        "laravel queues",
        "mysql",
        "phpunit",
        "tdd"
      ],
      "date": {
        "start": "2020-09",
        "end": "2021-08 | WIP (Pas complet lorsque je suis partis)"
      }
    },
    {
      "id": 5,
      "title": "Fidensio | migration DB",
      "slug": "fidensio-migration",
      "type": "Back",
      "description": "L'application suivante constitue l'un des projets de Fidensio afin de pouvoir exploiter la toute nouvelle API et structure de l'entreprise. L'objectif de ce projet est de migrer une ancienne base de données vers une nouvelle infrastructure, tout en minimisant les risques de perturbation des activités de l'entreprise. Afin de s'assurer d'une transition simple et sans incidents majeurs, un système de queue pour gérer d'éventuels problèmes pouvant survenir lors de la migration a été mis en place. Ce projet a été entièrement fait par moi-même.",
      "tools": [
        "gitlab",
        "laravel 8",
        "php",
        "queues",
        "mysql"
      ],
      "date": {
        "start": "2021-07",
        "end": "2021-08"
      }
    },
    {
      "id": 6,
      "title": "Fidensio | Front-end",
      "slug": "fidensio-nuxt",
      "type": "Front",
      "description": "La toute nouvelle application front de Fidensio a été conçue avec la collaboration de freelancers. Pour obtenir les informations nécessaires, j'ai mis en relation cette application qui ne donnait que des informations statique (travail des freelancers) par les données disponible avec l'API de Fidensio.",
      "tools": [
        "gitlab",
        "vue.js",
        "nuxt.js",
        "axios"
      ],
      "date": {
        "start": "2021-07",
        "end": "2021-08 | Inconnue"
      }
    }
  ]
}